; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite1 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite2 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	satellite3 - satellite
	instrument20 - instrument
	instrument21 - instrument
	satellite4 - satellite
	instrument22 - instrument
	instrument23 - instrument
	instrument24 - instrument
	instrument25 - instrument
	instrument26 - instrument
	instrument27 - instrument
	instrument28 - instrument
	spectrograph6 - mode
	infrared1 - mode
	thermograph8 - mode
	infrared5 - mode
	image3 - mode
	infrared9 - mode
	image2 - mode
	thermograph7 - mode
	image4 - mode
	spectrograph0 - mode
	Star0 - direction
	Star2 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Star23 - direction
	Star24 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared9)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph8)
	(supports instrument2 image2)
	(supports instrument2 image4)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared9)
	(calibration_target instrument3 Star0)
	(supports instrument4 image3)
	(supports instrument4 thermograph8)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared9)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph8)
	(supports instrument7 spectrograph6)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared9)
	(supports instrument8 thermograph7)
	(calibration_target instrument8 Star2)
	(supports instrument9 thermograph7)
	(calibration_target instrument9 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(on_board instrument5 satellite0)
	(on_board instrument6 satellite0)
	(on_board instrument7 satellite0)
	(on_board instrument8 satellite0)
	(on_board instrument9 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument10 infrared1)
	(supports instrument10 thermograph8)
	(supports instrument10 spectrograph6)
	(calibration_target instrument10 Star4)
	(supports instrument11 image4)
	(supports instrument11 thermograph7)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation3)
	(supports instrument12 infrared9)
	(supports instrument12 thermograph8)
	(supports instrument12 infrared5)
	(calibration_target instrument12 GroundStation3)
	(supports instrument13 image2)
	(supports instrument13 infrared1)
	(calibration_target instrument13 Star4)
	(supports instrument14 image3)
	(calibration_target instrument14 GroundStation3)
	(supports instrument15 thermograph7)
	(calibration_target instrument15 Star2)
	(on_board instrument10 satellite1)
	(on_board instrument11 satellite1)
	(on_board instrument12 satellite1)
	(on_board instrument13 satellite1)
	(on_board instrument14 satellite1)
	(on_board instrument15 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon19)
	(supports instrument16 infrared9)
	(supports instrument16 image2)
	(calibration_target instrument16 Star4)
	(supports instrument17 infrared5)
	(calibration_target instrument17 Star0)
	(supports instrument18 infrared9)
	(calibration_target instrument18 GroundStation1)
	(supports instrument19 infrared5)
	(supports instrument19 image2)
	(calibration_target instrument19 GroundStation3)
	(on_board instrument16 satellite2)
	(on_board instrument17 satellite2)
	(on_board instrument18 satellite2)
	(on_board instrument19 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
	(supports instrument20 image2)
	(supports instrument20 image3)
	(supports instrument20 image4)
	(calibration_target instrument20 GroundStation1)
	(supports instrument21 image3)
	(supports instrument21 thermograph8)
	(supports instrument21 infrared5)
	(calibration_target instrument21 Star2)
	(on_board instrument20 satellite3)
	(on_board instrument21 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
	(supports instrument22 thermograph8)
	(supports instrument22 infrared5)
	(calibration_target instrument22 Star4)
	(supports instrument23 thermograph8)
	(supports instrument23 image3)
	(calibration_target instrument23 Star2)
	(supports instrument24 thermograph8)
	(calibration_target instrument24 Star2)
	(supports instrument25 infrared5)
	(calibration_target instrument25 Star2)
	(supports instrument26 image3)
	(calibration_target instrument26 Star4)
	(supports instrument27 image2)
	(supports instrument27 infrared9)
	(calibration_target instrument27 GroundStation3)
	(supports instrument28 spectrograph0)
	(supports instrument28 image4)
	(supports instrument28 thermograph7)
	(calibration_target instrument28 GroundStation1)
	(on_board instrument22 satellite4)
	(on_board instrument23 satellite4)
	(on_board instrument24 satellite4)
	(on_board instrument25 satellite4)
	(on_board instrument26 satellite4)
	(on_board instrument27 satellite4)
	(on_board instrument28 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star16)
)
(:goal (and
	(pointing satellite1 Phenomenon19)
	(have_image Phenomenon5 thermograph8)
	(have_image Phenomenon5 spectrograph0)
	(have_image Phenomenon5 image3)
	(have_image Star6 spectrograph0)
	(have_image Star6 spectrograph6)
	(have_image Star6 image3)
	(have_image Planet7 spectrograph6)
	(have_image Planet7 infrared5)
	(have_image Planet7 image2)
	(have_image Phenomenon8 spectrograph6)
	(have_image Phenomenon8 infrared5)
	(have_image Phenomenon8 thermograph7)
	(have_image Planet9 spectrograph6)
	(have_image Star10 spectrograph6)
	(have_image Star11 thermograph7)
	(have_image Star11 image4)
	(have_image Star11 image3)
	(have_image Phenomenon12 image4)
	(have_image Planet13 infrared5)
	(have_image Planet13 spectrograph6)
	(have_image Planet13 image2)
	(have_image Phenomenon14 thermograph7)
	(have_image Planet15 image3)
	(have_image Star16 image3)
	(have_image Star16 image4)
	(have_image Planet18 infrared9)
	(have_image Planet18 infrared5)
	(have_image Planet18 thermograph7)
	(have_image Phenomenon19 image2)
	(have_image Phenomenon19 image4)
	(have_image Star20 spectrograph0)
	(have_image Phenomenon21 image4)
	(have_image Phenomenon21 image2)
	(have_image Phenomenon21 thermograph7)
	(have_image Planet22 image2)
	(have_image Planet22 spectrograph6)
	(have_image Star23 image2)
	(have_image Star23 infrared9)
	(have_image Star24 spectrograph6)
	(have_image Star24 infrared5)
))


)

; plan
1. (switch-on instrument16 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument16)
   goals met: 1 of 41
2. (turn-to satellite2 star4 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star4)
   goals met: 1 of 41
3. (calibrate satellite2 instrument16 star4)
   added: (calibrated instrument16)
   goals met: 1 of 41
4. (turn-to satellite2 planet7 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet7)
   goals met: 1 of 41
5. (take-image satellite2 planet7 instrument16 image2)
   added: (have_image planet7 image2)
   goals met: 2 of 41
6. (turn-to satellite2 phenomenon21 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon21)
   goals met: 2 of 41
7. (take-image satellite2 phenomenon21 instrument16 image2)
   added: (have_image phenomenon21 image2)
   goals met: 3 of 41
8. (turn-to satellite2 planet13 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 planet13)
   goals met: 3 of 41
9. (take-image satellite2 planet13 instrument16 image2)
   added: (have_image planet13 image2)
   goals met: 4 of 41
10. (turn-to satellite2 planet22 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet22)
   goals met: 4 of 41
11. (take-image satellite2 planet22 instrument16 image2)
   added: (have_image planet22 image2)
   goals met: 5 of 41
12. (turn-to satellite2 star23 planet22)
   deleted: (pointing satellite2 planet22)
   added: (pointing satellite2 star23)
   goals met: 5 of 41
13. (take-image satellite2 star23 instrument16 image2)
   added: (have_image star23 image2)
   goals met: 6 of 41
14. (take-image satellite2 star23 instrument16 infrared9)
   added: (have_image star23 infrared9)
   goals met: 7 of 41
15. (turn-to satellite2 planet18 star23)
   deleted: (pointing satellite2 star23)
   added: (pointing satellite2 planet18)
   goals met: 7 of 41
16. (take-image satellite2 planet18 instrument16 infrared9)
   added: (have_image planet18 infrared9)
   goals met: 8 of 41
17. (switch-on instrument7 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument7)
   goals met: 8 of 41
18. (calibrate satellite0 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 8 of 41
19. (turn-to satellite0 star24 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star24)
   goals met: 8 of 41
20. (take-image satellite0 star24 instrument7 spectrograph6)
   added: (have_image star24 spectrograph6)
   goals met: 9 of 41
21. (turn-to satellite0 planet9 star24)
   deleted: (pointing satellite0 star24)
   added: (pointing satellite0 planet9)
   goals met: 9 of 41
22. (take-image satellite0 planet9 instrument7 spectrograph6)
   added: (have_image planet9 spectrograph6)
   goals met: 10 of 41
23. (turn-to satellite0 phenomenon8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon8)
   goals met: 10 of 41
24. (take-image satellite0 phenomenon8 instrument7 spectrograph6)
   added: (have_image phenomenon8 spectrograph6)
   goals met: 11 of 41
25. (turn-to satellite0 planet22 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet22)
   goals met: 11 of 41
26. (take-image satellite0 planet22 instrument7 spectrograph6)
   added: (have_image planet22 spectrograph6)
   goals met: 12 of 41
27. (turn-to satellite4 groundstation1 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 groundstation1)
   goals met: 12 of 41
28. (switch-on instrument28 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument28)
   goals met: 12 of 41
29. (calibrate satellite4 instrument28 groundstation1)
   added: (calibrated instrument28)
   goals met: 12 of 41
30. (turn-to satellite4 star20 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 star20)
   goals met: 12 of 41
31. (take-image satellite4 star20 instrument28 spectrograph0)
   added: (have_image star20 spectrograph0)
   goals met: 13 of 41
32. (turn-to satellite4 star6 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 star6)
   goals met: 13 of 41
33. (take-image satellite4 star6 instrument28 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 14 of 41
34. (turn-to satellite4 star10 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star10)
   goals met: 14 of 41
35. (turn-to satellite4 star16 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star16)
   goals met: 14 of 41
36. (take-image satellite4 star16 instrument28 image4)
   added: (have_image star16 image4)
   goals met: 15 of 41
37. (turn-to satellite4 phenomenon14 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 phenomenon14)
   goals met: 15 of 41
38. (take-image satellite4 phenomenon14 instrument28 thermograph7)
   added: (have_image phenomenon14 thermograph7)
   goals met: 16 of 41
39. (turn-to satellite4 phenomenon8 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon8)
   goals met: 16 of 41
40. (take-image satellite4 phenomenon8 instrument28 thermograph7)
   added: (have_image phenomenon8 thermograph7)
   goals met: 17 of 41
41. (turn-to satellite4 phenomenon21 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon21)
   goals met: 17 of 41
42. (take-image satellite4 phenomenon21 instrument28 thermograph7)
   added: (have_image phenomenon21 thermograph7)
   goals met: 18 of 41
43. (take-image satellite4 phenomenon21 instrument28 image4)
   added: (have_image phenomenon21 image4)
   goals met: 19 of 41
44. (turn-to satellite2 phenomenon19 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 phenomenon19)
   goals met: 19 of 41
45. (take-image satellite2 phenomenon19 instrument16 image2)
   added: (have_image phenomenon19 image2)
   goals met: 20 of 41
46. (turn-to satellite0 star6 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 star6)
   goals met: 20 of 41
47. (take-image satellite0 star6 instrument7 spectrograph6)
   added: (have_image star6 spectrograph6)
   goals met: 21 of 41
48. (turn-to satellite0 star10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star10)
   goals met: 21 of 41
49. (take-image satellite0 star10 instrument7 spectrograph6)
   added: (have_image star10 spectrograph6)
   goals met: 22 of 41
50. (turn-to satellite0 planet7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet7)
   goals met: 22 of 41
51. (take-image satellite0 planet7 instrument7 spectrograph6)
   added: (have_image planet7 spectrograph6)
   goals met: 23 of 41
52. (turn-to satellite4 phenomenon5 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 phenomenon5)
   goals met: 23 of 41
53. (take-image satellite4 phenomenon5 instrument28 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 24 of 41
54. (turn-to satellite0 planet13 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet13)
   goals met: 24 of 41
55. (take-image satellite0 planet13 instrument7 spectrograph6)
   added: (have_image planet13 spectrograph6)
   goals met: 25 of 41
56. (turn-to satellite4 star11 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 star11)
   goals met: 25 of 41
57. (take-image satellite4 star11 instrument28 image4)
   added: (have_image star11 image4)
   goals met: 26 of 41
58. (take-image satellite4 star11 instrument28 thermograph7)
   added: (have_image star11 thermograph7)
   goals met: 27 of 41
59. (turn-to satellite4 phenomenon12 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 phenomenon12)
   goals met: 27 of 41
60. (take-image satellite4 phenomenon12 instrument28 image4)
   added: (have_image phenomenon12 image4)
   goals met: 28 of 41
61. (turn-to satellite4 phenomenon19 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon19)
   goals met: 28 of 41
62. (take-image satellite4 phenomenon19 instrument28 image4)
   added: (have_image phenomenon19 image4)
   goals met: 29 of 41
63. (turn-to satellite4 planet18 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 planet18)
   goals met: 29 of 41
64. (take-image satellite4 planet18 instrument28 thermograph7)
   added: (have_image planet18 thermograph7)
   goals met: 30 of 41
65. (switch-on instrument21 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument21)
   goals met: 30 of 41
66. (turn-to satellite3 star2 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star2)
   goals met: 30 of 41
67. (calibrate satellite3 instrument21 star2)
   added: (calibrated instrument21)
   goals met: 30 of 41
68. (turn-to satellite3 star24 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star24)
   goals met: 30 of 41
69. (take-image satellite3 star24 instrument21 infrared5)
   added: (have_image star24 infrared5)
   goals met: 31 of 41
70. (turn-to satellite3 phenomenon8 star24)
   deleted: (pointing satellite3 star24)
   added: (pointing satellite3 phenomenon8)
   goals met: 31 of 41
71. (take-image satellite3 phenomenon8 instrument21 infrared5)
   added: (have_image phenomenon8 infrared5)
   goals met: 32 of 41
72. (turn-to satellite3 planet7 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet7)
   goals met: 32 of 41
73. (take-image satellite3 planet7 instrument21 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 33 of 41
74. (turn-to satellite3 planet13 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet13)
   goals met: 33 of 41
75. (take-image satellite3 planet13 instrument21 infrared5)
   added: (have_image planet13 infrared5)
   goals met: 34 of 41
76. (turn-to satellite3 planet18 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet18)
   goals met: 34 of 41
77. (take-image satellite3 planet18 instrument21 infrared5)
   added: (have_image planet18 infrared5)
   goals met: 35 of 41
78. (turn-to satellite3 star6 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 star6)
   goals met: 35 of 41
79. (take-image satellite3 star6 instrument21 image3)
   added: (have_image star6 image3)
   goals met: 36 of 41
80. (turn-to satellite3 star16 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star16)
   goals met: 36 of 41
81. (take-image satellite3 star16 instrument21 image3)
   added: (have_image star16 image3)
   goals met: 37 of 41
82. (turn-to satellite3 phenomenon5 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 phenomenon5)
   goals met: 37 of 41
83. (take-image satellite3 phenomenon5 instrument21 image3)
   added: (have_image phenomenon5 image3)
   goals met: 38 of 41
84. (take-image satellite3 phenomenon5 instrument21 thermograph8)
   added: (have_image phenomenon5 thermograph8)
   goals met: 39 of 41
85. (turn-to satellite3 planet15 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 planet15)
   goals met: 39 of 41
86. (take-image satellite3 planet15 instrument21 image3)
   added: (have_image planet15 image3)
   goals met: 40 of 41
87. (turn-to satellite3 star11 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 star11)
   goals met: 40 of 41
88. (take-image satellite3 star11 instrument21 image3)
   added: (have_image star11 image3)
   goals met: 41 of 41
